[
    "College of Agriculture (DAC), Kabba, Kogi State.",
    "Federal College of Agriculture Akure, Ondo State.",
     "Federal College of Agriculture, Dadinkowa, Gombe State.",
     "Federal College of Agriculture, Ibadan, Oyo State.",
     "Federal College of Agriculture Ishiagu, Ebonyi State.",
     "Federal College of Animal Health and Production Technology, Ibadan, Oyo State.",
     "Federal College of Animal Health and Production Technology, Vom, Plateau State.",
     "Federal College of Fisheries and Marine Technology, Lagos.",
     "Federal College of Freshwater Fisheries Technology, Baga, Borno State.",
     "Federal College of Freshwater Fisheries Technology, New Bussa, Niger State.",
     "Federal College of Forestry Mechanisation, Afaka, Kaduna State.",
     "Federal College of Land Resources Technology, Kuru, Jos, Plateau State.",
     "Federal College of Land Resources Technology, Owerri Imo State.",
     "Federal College of Wildlife Management, New Bussa, Niger State.",
     "Federal College of Forestry, Ibadan, Oyo State.",
     "Federal College of Forestry, Jos, Plateau State.",
     "Samaru College of Agriculture (DAC), Zaria Kaduna State.",
     "Adamawa State College of Agriculture, Mubi.",
     "Akperan Orshi College of Agriculture, Yandev Gboko.",
     "Akwa Ibom State College of Agriculture, Obio-Akpa.",
     "Anambra State College of Agriculture, Igbariam.",
     "Audu Bako School of Agriculture, Danbatta, Kano State.",
     "College of Agriculture, Jalingo, Taraba State.",
     "College of Agriculture, Lafia, Nassarawa State.",
     "College of Agriculture, Zuru, Kebbi State.",
     "Edo State College of Agriculture, Iguariakhi.",
     "Jigawa State College of Agriculture, Hadejia.",
     "Mohamet Lawan College of Agriculture Maiduguri, Borno State.",
     "Niger State College of Agriculture, Mokwa.",
     "Oyo State College of Agriculture, Oyo.",
     "Plateau State College of Agriculture, Garkawa.",
     "Regional Agricultural Training School, Maiduguri, Borno State.",
     "Rivers State Institute of Agricultural Research and Training, Onne.",
     "School of Agriculture, Ikorodu, Lagos State.",
     "Yobe State College of Agriculture, Gujba.",
     "Zamfara State College of Agriculture, Bakura.",
     "Others"
  ]